# Criando e Removendo Colunas do DataFrame

In [14]:
import pandas as pd
import numpy as np
from random import choice

In [7]:
df = pd.read_csv('C:\\Series_Temporais\\UDEMY_TSA_FINAL\\peso-altura.csv')

In [8]:
df.head()

   Unnamed: 0  Massa corporal (kg)  Altura (cm)
0           0                   72          180
1           1                   80          170
2           2                   60          175
3           3                   90          174
4           4                  100          185

In [9]:
# dimensão/tamanho do dataframe / coluna e linhas
df.shape

(20, 3)

In [10]:
# Adicionando coluna no dataframe
# fazendo uma lista
idade = np.random.randint(17,40,20)

In [11]:
idade

array([20, 20, 22, 29, 33, 19, 19, 33, 23, 33, 31, 23, 22, 36, 25, 22, 38,
       26, 31, 24])

In [12]:
# Adicionando o array que criei dentro do meu dataset
df['Idade'] = idade

In [13]:
df.head()

   Unnamed: 0  Massa corporal (kg)  Altura (cm)  Idade
0           0                   72          180     20
1           1                   80          170     20
2           2                   60          175     22
3           3                   90          174     29
4           4                  100          185     33

In [15]:
# choice é um modulo que escolhe um valor dentro da lista
choice(['M', 'F'])

'M'

In [17]:
# Criando outra lista para add no meu dataset 
sexo = [choice(['M', 'F']) for i in range(20)]

In [18]:
sexo

['F',
 'F',
 'M',
 'F',
 'F',
 'F',
 'M',
 'M',
 'M',
 'M',
 'F',
 'F',
 'F',
 'M',
 'F',
 'F',
 'F',
 'F',
 'F',
 'M']

In [19]:
df['Sexo'] = sexo

In [20]:
df.head()

   Unnamed: 0  Massa corporal (kg)  Altura (cm)  Idade Sexo
0           0                   72          180     20    F
1           1                   80          170     20    F
2           2                   60          175     22    M
3           3                   90          174     29    F
4           4                  100          185     33    F

# Removendo coluna

In [23]:
# primeiro parametro é a coluna, axis=1 é um parametro para a coluna e inplance é salvar a alteração
# no proprio dataset
df = df.drop('Unnamed: 0', axis=1, inplance=True)

In [24]:
df.head()

   Massa corporal (kg)  Altura (cm)  Idade Sexo
0                   72          180     20    F
1                   80          170     20    F
2                   60          175     22    M
3                   90          174     29    F
4                  100          185     33    F